OF01inputOutput/OF01_inputOutput/testCase/constant/customProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      customProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

someWord hello_world;

someScalar 8.26;

someBool on;

someList
(
    3
    1
    0
);

someHashTable
(
    key0 (0 0 0)
    key1 (1 0 0)
);




// ************************************************************************* //
